In [13]:
from sqlalchemy import create_engine, inspect
import pandas as pd

In [106]:
import matplotlib.pyplot as plt
%matplotlib
from matplotlib.pyplot import figure

Using matplotlib backend: MacOSX

In [4]:
engine = create_engine('postgresql://postgres:1234@localhost/Employee_db')

In [6]:
conn = engine.connect()

In [14]:
inspector = inspect(engine)

In [15]:
inspector.get_table_names()

['titles', 'employees', 'dept_emp', 'departments', 'dept_manager', 'salaries']

In [32]:
inspector.get_columns("employees")

[{'name': 'emp_no',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'emp_title_id',
  'type': VARCHAR(length=10),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'birth_date',
  'type': DATE(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'first_name',
  'type': VARCHAR(length=50),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'last_name',
  'type': VARCHAR(length=50),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'sex',
  'type': VARCHAR(length=2),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'hire_date',
  'type': DATE(),
  'nullable': True,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'last_updated',
  'type': TIMESTAMP(),
  'nullable': True,
  'default': 'CURRENT_TIMESTAMP',
  'autoincrement': False,
  'comment': None}]

In [68]:
query = """
            SELECT
                e.emp_no,
                AVG(s.salary) as "Average_salary"
            FROM 
                employees e
            JOIN 
                salaries s ON s.emp_no = e.emp_no
            GROUP BY 
                e.emp_no
         """

In [71]:
df = pd.read_sql(query, conn)

In [72]:
df

        emp_no  Average_salary
0        10001         60117.0
1        10002         65828.0
2        10003         40006.0
3        10004         40054.0
4        10005         78228.0
...        ...             ...
300019  499995         40000.0
300020  499996         58058.0
300021  499997         49597.0
300022  499998         40000.0
300023  499999         63707.0

[300024 rows x 2 columns]

In [113]:
fig = plt.figure(figsize=(15,8))

plt.hist(df.Average_salary, color="orange")
plt.xlabel("Salaries ($)")
plt.ylabel("Density")
plt.title("Most Common Salary Ranges for Employees")

plt.savefig("Images/common_salaries.png", dpi=fig.dpi)

plt.show()

In [48]:
query2 = """
            SELECT 
                t.title,
                AVG(s.salary) as "Average_Salaries"
            FROM 
                employees e
            JOIN salaries s on e.emp_no = s.emp_no
            JOIN titles t on t.title_id = e.emp_title_id
            GROUP BY t.title
        """

In [49]:
df_title = pd.read_sql(query2, conn)

In [83]:
df_title = df_title.sort_values(by=["Average_Salaries"], ascending=True)
df_title

                title  Average_Salaries
3     Senior Engineer      48506.799871
1            Engineer      48535.336511
0  Assistant Engineer      48564.434447
6    Technique Leader      48582.896092
2             Manager      51531.041667
5               Staff      58465.382850
4        Senior Staff      58550.172704

In [112]:
fig = plt.figure(figsize=(15,8))

plt.barh(df_title.title, df_title.Average_Salaries, color = ["lightseagreen", "mediumturquoise", "aquamarine", "skyblue"])
plt.xlabel("Salaries ($)")
plt.ylabel("Employee Title")
plt.title("Average Salary by Title")

plt.savefig("Images/avg_salary_by_title.png", dpi=fig.dpi)

plt.show()